{
  "termsTitle": "Termos de Servico",
  "privacyTitle": "Politica de Privacidade",
  "loading": "Carregando...",
  "backToHome": "Voltar ao inicio",
  "errorTerms": "Erro ao carregar os Termos de Servico",
  "errorPrivacy": "Erro ao carregar a Politica de Privacidade",
  "documentVersion": "Versao do documento: {version}",
  "breadcrumbHome": "Inicio",
  "breadcrumbTerms": "Termos de Servico",
  "breadcrumbPrivacy": "Politica de Privacidade",
  "termsContent": "# Termos de Servico\n\n**Ultima atualizacao:** 25 de janeiro de 2026\n**Versao:** 2026-01-25\n\n---\n\n## 1. Aceitacao dos Termos\n\nAo acessar ou utilizar a plataforma Picks4All (\"a Plataforma\", \"o Servico\", \"nos\"), voce concorda em estar legalmente vinculado a estes Termos de Servico (\"Termos\"). Se voce nao concordar com algum destes termos, nao deve utilizar o Servico.\n\nEstes Termos constituem um acordo legal vinculante entre voce (\"Usuario\", \"voce\") e os operadores da Plataforma.\n\n---\n\n## 2. Descricao do Servico\n\n### 2.1 Natureza do Servico\n\nA Plataforma e um servico de entretenimento que permite aos usuarios:\n\n- Criar e participar de \"pools\" (grupos de previsoes) sobre eventos esportivos\n- Fazer previsoes (\"picks\") sobre resultados de partidas\n- Competir com outros usuarios em tabelas de classificacao (\"leaderboards\")\n- Gerenciar grupos privados de amigos, familiares ou comunidades\n\n### 2.2 Declaracao Importante: NAO e Apostas nem Jogos de Azar\n\n**A PLATAFORMA NAO E UM SITE DE APOSTAS NEM DE JOGOS DE AZAR.**\n\n- Nao e necessario nem aceito dinheiro real para participar das previsoes\n- Nao sao concedidos premios em dinheiro atraves da Plataforma\n- As previsoes sao puramente recreativas e de entretenimento\n- A Plataforma nao facilita, promove nem esta associada a atividades de apostas\n\nQualquer premio, recompensa ou reconhecimento que os organizadores de pools decidam conceder e de responsabilidade exclusiva de tais organizadores e e realizado fora do ambito da Plataforma.\n\n---\n\n## 3. Elegibilidade e Registro\n\n### 3.1 Requisitos de Idade\n\nPara utilizar a Plataforma, voce deve:\n\n- Ter pelo menos **13 anos de idade**\n- Se for menor de 18 anos, contar com o consentimento de seus pais ou responsaveis legais\n\n### 3.2 Conta de Usuario\n\nAo se registrar, voce se compromete a:\n\n- Fornecer informacoes verdadeiras, atuais e completas\n- Manter a confidencialidade de suas credenciais de acesso\n- Ser responsavel por todas as atividades realizadas com sua conta\n- Notificar-nos imediatamente sobre qualquer uso nao autorizado\n\n### 3.3 Uma Conta por Usuario\n\nCada pessoa fisica pode manter apenas uma conta ativa. A criacao de multiplas contas pode resultar na suspensao ou encerramento de todas as contas associadas.\n\n---\n\n## 4. Uso Aceitavel\n\n### 4.1 Conduta do Usuario\n\nAo utilizar a Plataforma, voce concorda em:\n\n- Cumprir todas as leis e regulamentos aplicaveis\n- Respeitar outros usuarios e manter um ambiente cordial\n- Nao utilizar linguagem ofensiva, discriminatoria ou ameacadora\n- Nao tentar manipular, hackear ou comprometer a seguranca do Servico\n- Nao utilizar bots, scripts automatizados ou ferramentas de scraping\n- Nao se passar por outras pessoas\n\n### 4.2 Conteudo do Usuario\n\nNomes de usuario, nomes de exibicao e qualquer conteudo que voce gere:\n\n- Nao devem ser ofensivos, discriminatorios ou inapropriados\n- Nao devem infringir direitos de terceiros (marcas, direitos autorais, etc.)\n- Nao devem conter informacoes pessoais de terceiros sem seu consentimento\n\n### 4.3 Uso Proibido\n\nE expressamente proibido:\n\n- Utilizar a Plataforma para atividades ilegais\n- Tentar acessar contas de outros usuarios\n- Distribuir malware ou codigo malicioso\n- Realizar engenharia reversa do software\n- Revender ou comercializar o acesso ao Servico\n- Utilizar a Plataforma para organizar apostas com dinheiro real\n\n---\n\n## 5. Pools e Previsoes\n\n### 5.1 Criacao de Pools\n\nOs usuarios podem criar pools como \"Hosts\" (anfitrioes). O Host e responsavel por:\n\n- Configurar as regras do pool (sistema de pontuacao, prazos, etc.)\n- Gerenciar a membresia do pool\n- Publicar resultados oficiais das partidas\n- Manter um ambiente justo para todos os participantes\n\n### 5.2 Participacao em Pools\n\nOs participantes (\"Players\") aceitam:\n\n- Cumprir as regras especificas de cada pool\n- Realizar suas previsoes antes dos prazos estabelecidos\n- Aceitar os resultados publicados pelo Host\n- Respeitar as decisoes dos administradores do pool\n\n### 5.3 Prazos (Deadlines)\n\n- As previsoes devem ser realizadas antes do prazo configurado para cada partida\n- Uma vez passado o prazo, as previsoes nao podem ser modificadas\n- O prazo padrao e de 10 minutos antes do inicio da partida\n\n### 5.4 Resultados e Pontuacao\n\n- Os Hosts publicam os resultados oficiais de cada partida\n- A pontuacao e calculada automaticamente de acordo com as regras configuradas\n- As correcoes de erros (\"erratas\") ficam registradas com rastreabilidade\n\n---\n\n## 6. Propriedade Intelectual\n\n### 6.1 Nossa Propriedade\n\nA Plataforma, incluindo seu codigo, design, logos, textos e funcionalidades, e propriedade de seus operadores e esta protegida por leis de propriedade intelectual.\n\n### 6.2 Licenca de Uso\n\nConcedemos a voce uma licenca limitada, nao exclusiva, intransferivel e revogavel para utilizar a Plataforma unicamente para seu uso pessoal e nao comercial, sujeito a estes Termos.\n\n### 6.3 Conteudo de Terceiros\n\nAs informacoes sobre equipes, torneios e partidas podem vir de fontes de terceiros. Os nomes, logos e marcas de equipes e competicoes pertencem aos seus respectivos proprietarios.\n\n---\n\n## 7. Privacidade\n\nO uso de seus dados pessoais e regido por nossa Politica de Privacidade, que faz parte integrante destes Termos. Ao aceitar estes Termos, voce tambem aceita nossa Politica de Privacidade.\n\n---\n\n## 8. Disponibilidade do Servico\n\n### 8.1 Sem Garantia de Disponibilidade\n\nO Servico e fornecido \"como esta\" e \"conforme disponivel\". Nao garantimos:\n\n- Disponibilidade ininterrupta do Servico\n- Ausencia de erros ou defeitos\n- Que o Servico atenda a todas as suas expectativas\n\n### 8.2 Manutencao\n\nReservamo-nos o direito de:\n\n- Realizar manutencao programada ou de emergencia\n- Modificar, suspender ou descontinuar funcionalidades\n- Atualizar o Servico sem aviso previo\n\n---\n\n## 9. Limitacao de Responsabilidade\n\n### 9.1 Exclusao de Danos\n\nNa maxima extensao permitida por lei, nao seremos responsaveis por:\n\n- Danos indiretos, incidentais, especiais ou consequentes\n- Perda de dados, lucros ou oportunidades\n- Interrupcoes do servico\n- Acoes de outros usuarios\n- Qualquer atividade realizada fora da Plataforma (incluindo premios organizados por terceiros)\n\n### 9.2 Limite de Responsabilidade\n\nNossa responsabilidade total nao excedera o valor que voce tenha pago pelo Servico nos ultimos 12 meses, ou $0 se nao tiver realizado nenhum pagamento.\n\n---\n\n## 10. Indenizacao\n\nVoce concorda em indenizar e isentar a Plataforma, seus operadores, funcionarios e afiliados de qualquer reclamacao, dano, perda ou despesa (incluindo honorarios legais) decorrente de:\n\n- Seu uso do Servico\n- Sua violacao destes Termos\n- Sua violacao de direitos de terceiros\n- Conteudo que voce gere ou compartilhe\n\n---\n\n## 11. Rescisao\n\n### 11.1 Pelo Usuario\n\nVoce pode encerrar sua conta a qualquer momento entrando em contato conosco ou utilizando as opcoes disponiveis na Plataforma.\n\n### 11.2 Por Nos\n\nReservamo-nos o direito de suspender ou encerrar sua conta se:\n\n- Voce violar estes Termos\n- Realizar atividades fraudulentas ou suspeitas\n- Nao utilizar a conta por um periodo prolongado\n- Por qualquer outra razao a nosso criterio\n\n### 11.3 Efeitos da Rescisao\n\nApos a rescisao:\n\n- Voce perdera o acesso a sua conta e dados associados\n- As clausulas que por sua natureza devam sobreviver, continuarao em vigor\n\n---\n\n## 12. Modificacoes\n\n### 12.1 Alteracoes nos Termos\n\nPodemos modificar estes Termos a qualquer momento. Notificaremos voce sobre alteracoes materiais mediante:\n\n- Aviso na Plataforma\n- E-mail para o endereco registrado\n- Solicitacao de reaceitacao ao fazer login\n\n### 12.2 Aceitacao de Alteracoes\n\nO uso continuado do Servico apos a notificacao constitui aceitacao dos novos Termos.\n\n---\n\n## 13. Disposicoes Gerais\n\n### 13.1 Lei Aplicavel\n\nEstes Termos sao regidos pelas leis da Republica da Colombia, sem prejuizo das normas de protecao ao consumidor de sua jurisdicao que possam ser aplicaveis.\n\n### 13.2 Resolucao de Disputas\n\nPara qualquer disputa relacionada a estes Termos ou ao Servico:\n\n1. Primeiro tentaremos resolve-la de maneira amigavel\n2. Se nao for possivel, as partes concordam em submeter-se aos tribunais competentes de Bogota, Colombia\n\n### 13.3 Divisibilidade\n\nSe alguma disposicao destes Termos for considerada invalida, as demais disposicoes permanecerao em pleno vigor.\n\n### 13.4 Renuncia\n\nA falta de exercicio de qualquer direito sob estes Termos nao constitui uma renuncia a esse direito.\n\n### 13.5 Acordo Completo\n\nEstes Termos, juntamente com a Politica de Privacidade, constituem o acordo completo entre voce e nos em relacao ao uso do Servico.\n\n---\n\n## 14. Contato\n\nPara duvidas sobre estes Termos de Servico, voce pode entrar em contato conosco em:\n\n- **E-mail:** soporte@picks4all.com\n\n---\n\n*Ao utilizar a Plataforma, voce confirma que leu, entendeu e aceitou estes Termos de Servico.*",
  "privacyContent": "# Politica de Privacidade\n\n**Ultima atualizacao:** 25 de janeiro de 2026\n**Versao:** 2026-01-25\n\n---\n\n## 1. Introducao\n\nEsta Politica de Privacidade descreve como a plataforma Picks4All (\"a Plataforma\", \"o Servico\", \"nos\") coleta, utiliza, armazena e protege suas informacoes pessoais.\n\nEstamos comprometidos em proteger sua privacidade e ser transparentes sobre nossas praticas de dados. Ao utilizar nosso Servico, voce concorda com as praticas descritas nesta Politica.\n\n---\n\n## 2. Informacoes que Coletamos\n\n### 2.1 Informacoes que Voce Fornece\n\n**Dados de registro:**\n- Endereco de e-mail\n- Nome de usuario (username)\n- Nome de exibicao (display name)\n- Senha (armazenada de forma segura com hash)\n\n**Dados de perfil opcionais:**\n- Fuso horario preferido\n- Preferencias de notificacoes\n\n**Dados de uso do servico:**\n- Previsoes realizadas em pools\n- Participacao em pools (como host ou jogador)\n- Interacoes com outros usuarios\n\n### 2.2 Informacoes Coletadas Automaticamente\n\n**Dados tecnicos:**\n- Endereco IP\n- Tipo de navegador e versao\n- Sistema operacional\n- Identificadores de dispositivo\n- Paginas visitadas e tempo de permanencia\n\n**Dados de registro (logs):**\n- Data e hora de acesso\n- Acoes realizadas (login, criacao de pools, etc.)\n- Erros e eventos do sistema\n\n### 2.3 Informacoes de Terceiros\n\nSe voce optar por fazer login com o Google:\n- ID de usuario do Google\n- Nome associado a sua conta do Google\n- Endereco de e-mail do Google\n\nNao acessamos seus contatos, calendario, arquivos do Drive nem quaisquer outros dados do Google alem dos mencionados.\n\n---\n\n## 3. Como Utilizamos suas Informacoes\n\nUtilizamos suas informacoes para:\n\n### 3.1 Fornecer o Servico\n- Criar e gerenciar sua conta\n- Permitir sua participacao em pools\n- Calcular pontuacoes e classificacoes\n- Enviar notificacoes sobre atividade relevante\n\n### 3.2 Melhorar o Servico\n- Analisar padroes de uso (de forma agregada)\n- Identificar e corrigir erros\n- Desenvolver novas funcionalidades\n- Otimizar desempenho e experiencia do usuario\n\n### 3.3 Comunicacoes\n- Enviar e-mails transacionais (recuperacao de senha, etc.)\n- Notificar alteracoes nos Termos ou Politica de Privacidade\n- Enviar comunicacoes de marketing (somente com seu consentimento)\n\n### 3.4 Seguranca e Conformidade\n- Detectar e prevenir fraude ou abuso\n- Cumprir obrigacoes legais\n- Proteger nossos direitos e os de outros usuarios\n- Manter registros de auditoria\n\n---\n\n## 4. Base Legal para o Processamento\n\nProcessamos suas informacoes sob as seguintes bases legais:\n\n| Base Legal | Aplicacao |\n|------------|----------|\n| **Consentimento** | Comunicacoes de marketing, cookies opcionais |\n| **Execucao de contrato** | Fornecer o servico, gerenciar sua conta |\n| **Interesse legitimo** | Seguranca, prevencao de fraude, melhoria do servico |\n| **Obrigacao legal** | Cumprimento de leis e regulamentos |\n\n---\n\n## 5. Como Compartilhamos suas Informacoes\n\n### 5.1 Com Outros Usuarios\n\nDentro da Plataforma, outros usuarios podem ver:\n- Seu nome de usuario e nome de exibicao\n- Sua posicao nas tabelas de classificacao\n- Suas previsoes (apos o deadline de cada partida)\n- Seu historico de participacao em pools compartilhados\n\n### 5.2 Com Provedores de Servicos\n\nPodemos compartilhar dados com provedores que nos ajudam a operar o Servico:\n\n| Provedor | Proposito | Dados Compartilhados |\n|----------|-----------|---------------------|\n| Provedor de hospedagem | Armazenamento e servidores | Todos os dados do servico |\n| Servico de e-mail | Envio de e-mails | E-mail, nome |\n| Servico de autenticacao (Google) | Login social | ID de sessao |\n\nEstes provedores sao obrigados contratualmente a proteger seus dados e so podem usa-los para os fins especificados.\n\n### 5.3 Por Razoes Legais\n\nPodemos divulgar informacoes se acreditarmos de boa-fe que e necessario para:\n- Cumprir uma obrigacao legal\n- Responder a solicitacoes legais validas (ordens judiciais, etc.)\n- Proteger a seguranca de usuarios ou do publico\n- Defender nossos direitos legais\n\n### 5.4 Transferencias de Negocio\n\nEm caso de fusao, aquisicao ou venda de ativos, suas informacoes podem ser transferidas como parte da transacao. Notificaremos voce sobre qualquer mudanca de proprietario ou uso de suas informacoes.\n\n### 5.5 O que NAO Fazemos\n\n- **NAO vendemos** suas informacoes pessoais\n- **NAO compartilhamos** dados com anunciantes para publicidade direcionada\n- **NAO usamos** seus dados para perfilamento com fins comerciais de terceiros\n\n---\n\n## 6. Retencao de Dados\n\n### 6.1 Periodos de Retencao\n\n| Tipo de Dado | Periodo de Retencao |\n|--------------|--------------------|\n| Dados da conta | Enquanto a conta estiver ativa + 30 dias |\n| Previsoes e pontuacoes | Enquanto a conta estiver ativa |\n| Logs de seguranca | 12 meses |\n| Logs de auditoria | 24 meses |\n| Dados de pools excluidos | 90 dias (para possivel restauracao) |\n\n### 6.2 Exclusao de Conta\n\nQuando voce solicitar a exclusao de sua conta:\n- Seus dados pessoais serao excluidos em um prazo de 30 dias\n- Dados anonimizados podem ser mantidos para analise estatistica\n- Logs de auditoria sao mantidos pelo periodo legalmente exigido\n\n---\n\n## 7. Seus Direitos\n\nDependendo de sua localizacao, voce pode ter os seguintes direitos:\n\n### 7.1 Direitos Gerais\n\n- **Acesso:** Solicitar uma copia de seus dados pessoais\n- **Retificacao:** Corrigir dados inexatos ou incompletos\n- **Exclusao:** Solicitar a exclusao de seus dados\n- **Portabilidade:** Receber seus dados em formato estruturado\n- **Objecao:** Opor-se a certos tipos de processamento\n\n### 7.2 Para Usuarios na Colombia\n\nSob a Lei 1581 de 2012 (Lei de Habeas Data), voce tem o direito de:\n- Conhecer, atualizar e retificar suas informacoes\n- Solicitar prova da autorizacao concedida\n- Ser informado sobre o uso de seus dados\n- Revogar a autorizacao e/ou solicitar supressao\n- Apresentar reclamacoes junto a SIC (Superintendencia de Industria e Comercio)\n\n### 7.3 Para Usuarios na Uniao Europeia\n\nSob o GDPR, alem dos direitos gerais, voce tem o direito de:\n- Retirar seu consentimento a qualquer momento\n- Apresentar reclamacoes junto a sua autoridade local de protecao de dados\n- Nao ser objeto de decisoes automatizadas com efeitos legais\n\n### 7.4 Para Usuarios nos Estados Unidos (California)\n\nSob a CCPA, os residentes da California tem o direito de:\n- Saber quais informacoes pessoais sao coletadas\n- Saber se suas informacoes sao vendidas ou compartilhadas\n- Optar por nao participar da venda de dados (nao vendemos dados)\n- Nao ser discriminados por exercerem seus direitos\n\n### 7.5 Como Exercer seus Direitos\n\nPara exercer qualquer um destes direitos, entre em contato conosco em:\n- **E-mail:** privacidad@picks4all.com\n\nResponderemos a sua solicitacao dentro dos prazos legais aplicaveis (geralmente 15-30 dias).\n\n---\n\n## 8. Seguranca de Dados\n\n### 8.1 Medidas Tecnicas\n\nImplementamos medidas de seguranca que incluem:\n- Criptografia de dados em transito (HTTPS/TLS)\n- Criptografia de senhas com algoritmos seguros (bcrypt)\n- Tokens de autenticacao com expiracao\n- Protecao contra ataques comuns (XSS, CSRF, SQL injection)\n\n### 8.2 Medidas Organizacionais\n\n- Acesso restrito a dados pessoais (principio do minimo privilegio)\n- Politicas internas de seguranca da informacao\n- Monitoramento de acessos e atividades suspeitas\n\n### 8.3 Limitacoes\n\nNenhum sistema e 100% seguro. Embora nos esforcemos para proteger suas informacoes, nao podemos garantir seguranca absoluta. Voce e responsavel por manter a confidencialidade de suas credenciais.\n\n---\n\n## 9. Transferencias Internacionais\n\n### 9.1 Localizacao dos Dados\n\nNossos servidores podem estar localizados em diferentes paises. Ao utilizar o Servico, voce consente a transferencia de seus dados para essas localidades.\n\n### 9.2 Salvaguardas\n\nPara transferencias fora de sua jurisdicao, implementamos:\n- Clausulas contratuais padrao aprovadas\n- Avaliacoes de impacto quando exigidas\n- Acordos de processamento de dados com provedores\n\n---\n\n## 10. Menores de Idade\n\n### 10.1 Idade Minima\n\nO Servico e destinado a usuarios de **13 anos ou mais**.\n\n### 10.2 Menores de 18 anos\n\nSe voce tem entre 13 e 17 anos, deve contar com o consentimento de seus pais ou responsaveis legais para utilizar o Servico.\n\n### 10.3 Menores de 13 anos\n\nNao coletamos intencionalmente informacoes de menores de 13 anos. Se descobrirmos que coletamos dados de um menor de 13 anos, excluiremos essas informacoes imediatamente.\n\nSe voce e pai/responsavel e acredita que seu filho menor de 13 anos forneceu informacoes, entre em contato conosco.\n\n---\n\n## 11. Cookies e Tecnologias Similares\n\n### 11.1 Uso Atual\n\nAtualmente, a Plataforma utiliza:\n- **LocalStorage do navegador:** Para armazenar seu token de sessao\n- **Nao utilizamos cookies de rastreamento nem de terceiros**\n\n### 11.2 Alteracoes Futuras\n\nSe no futuro implementarmos cookies adicionais:\n- Informaremos voce mediante atualizacao desta Politica\n- Solicitaremos seu consentimento quando exigido\n- Forneceremos opcoes para gerenciar suas preferencias\n\n---\n\n## 12. Links para Terceiros\n\nA Plataforma pode conter links para sites de terceiros. Nao somos responsaveis pelas praticas de privacidade destes sites. Recomendamos que voce revise suas politicas de privacidade antes de fornecer-lhes informacoes.\n\n---\n\n## 13. Alteracoes nesta Politica\n\n### 13.1 Notificacao de Alteracoes\n\nPodemos atualizar esta Politica de Privacidade periodicamente. Notificaremos voce sobre alteracoes materiais mediante:\n- Aviso destacado na Plataforma\n- E-mail para seu endereco registrado\n- Solicitacao de reaceitacao ao fazer login\n\n### 13.2 Historico de Versoes\n\nMantemos um historico de versoes anteriores desta Politica, disponivel mediante solicitacao.\n\n---\n\n## 14. Contato\n\nPara duvidas, solicitacoes ou reclamacoes relacionadas a esta Politica de Privacidade:\n\n**E-mail:** privacidad@picks4all.com\n**Tempo de resposta:** Nos esforcamos para responder a todas as solicitacoes dentro de 15 dias uteis.\n\n---\n\n## 15. Informacoes Adicionais para a Colombia\n\n### 15.1 Responsavel pelo Tratamento\n\nO responsavel pelo tratamento de seus dados pessoais e o operador da Plataforma Picks4All.\n\n### 15.2 Finalidades\n\nAs finalidades do tratamento estao descritas na Secao 3 desta Politica.\n\n### 15.3 Direitos do Titular\n\nSeus direitos como titular dos dados estao descritos na Secao 7.2.\n\n### 15.4 Autoridade de Controle\n\nVoce pode apresentar reclamacoes junto a:\n- **Superintendencia de Industria e Comercio (SIC)**\n- Carrera 13 No. 27-00, Bogota D.C., Colombia\n- www.sic.gov.co\n\n---\n\n*Ao utilizar a Plataforma, voce confirma que leu, entendeu e aceitou esta Politica de Privacidade.*"
}
